/**
 * Created by Administrator on 2016/9/14.
 */

//  总宽度650px(26个单位)，坦克宽度约等于50px（2个单位），小于50px使得更容易运动

var index = (function(){
    return{

        mapArr : [],// 存放地图 状态 二维数组( 0无障碍物，1砖头（可击破），2墙（不可击破），3河水（子弹可通过）)
        cellSize : 25,

        // 初始化
        init: function(){

            //$(document).on('click', '.tank', function(){
            //    console.log('a')
            //});

            this.createMap();// 创建地图（场景）

            // 地图二维数组
            $.bulletClass.prototype.mapArr = this.mapArr;// 初始化 子弹类 地图二维数组（该属性所有 坦克类对象 共用）
            $.tankClass.prototype.mapArr = this.mapArr;// 初始化 坦克类 地图二维数组（该属性所有 坦克类对象 共用）

            //地图每个单元格的边长(25px)
            $.bulletClass.prototype.cellSize = this.cellSize;
            $.tankClass.prototype.cellSize = this.cellSize;

            // 创建坦克
            var t = new $.tankClass( true, 100, 50, 25 );
            $('.container').append( t.$tank );
            t.tankRun();// 坦克运动
            t.tankShoot();// 坦克射击

            var t2 = new $.tankClass( false, 200, 200, 25 );
            $('.container').append( t2.$tank );
            t2.tankRun();
            t2.tankShoot();

        },

        // 创建 地图 （26*26 个单位）this 是 tankClass对象
        createMap: function(){

            var _mapArr = [];

            _mapArr[0]  =  [0,0,0,0,0,0,2,2,0,0,0,0,0,0,2,2,0,0,0,0,0,0,0,0,0,0];
            _mapArr[1]  =  [0,0,0,0,0,0,2,2,0,0,0,0,0,0,2,2,0,0,0,0,0,0,0,0,0,0];
            _mapArr[2]  =  [0,0,1,1,0,0,2,2,0,0,0,0,0,0,1,1,0,0,1,1,0,0,1,1,0,0];
            _mapArr[3]  =  [0,0,1,1,0,0,2,2,0,0,0,0,0,0,1,1,0,0,1,1,0,0,1,1,0,0];
            _mapArr[4]  =  [0,0,1,1,0,0,2,2,0,0,0,0,0,0,1,1,0,0,1,1,0,0,1,1,0,0];
            _mapArr[5]  =  [0,0,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,2,2,1,1,0,0];
            _mapArr[6]  =  [0,0,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,2,2,1,1,0,0];
            _mapArr[7]  =  [0,0,0,0,0,0,1,1,0,0,0,0,1,1,1,1,0,0,2,2,0,0,0,0,0,0];
            _mapArr[8]  =  [0,0,0,0,0,0,1,1,0,0,0,0,1,1,1,1,0,0,2,2,0,0,0,0,0,0];
            _mapArr[9]  =  [0,0,0,0,0,0,1,1,0,0,0,0,2,2,0,0,0,0,1,1,0,0,1,1,2,2];
            _mapArr[10] =  [0,0,0,0,0,0,1,1,0,0,0,0,2,2,0,0,0,0,1,1,0,0,1,1,2,2];
            _mapArr[11] =  [0,0,0,0,0,0,1,1,1,1,0,0,0,0,0,0,2,2,1,1,0,0,0,0,0,0];
            _mapArr[12] =  [0,0,0,0,0,0,1,1,1,1,0,0,0,0,0,0,2,2,1,1,0,0,0,0,0,0];
            _mapArr[13] =  [0,0,1,1,0,0,1,1,1,1,0,0,0,0,2,2,1,1,1,1,0,0,1,1,0,0];
            _mapArr[14] =  [0,0,1,1,0,0,1,1,1,1,0,0,0,0,2,2,1,1,1,1,0,0,1,1,0,0];
            _mapArr[15] =  [0,0,0,0,0,0,2,2,0,0,1,1,0,0,1,1,0,0,1,1,0,0,1,1,0,0];
            _mapArr[16] =  [0,0,0,0,0,0,2,2,0,0,1,1,0,0,1,1,0,0,1,1,0,0,1,1,0,0];
            _mapArr[17] =  [0,0,1,1,3,3,2,2,0,0,1,1,0,0,1,1,0,0,3,3,3,3,1,1,3,3];
            _mapArr[18] =  [2,2,1,1,3,3,2,2,0,0,1,1,0,0,1,1,0,0,3,3,3,3,1,1,3,3];
            _mapArr[19] =  [2,2,1,1,0,0,1,1,0,0,1,1,0,0,1,1,0,0,1,1,0,0,1,1,3,3];
            _mapArr[20] =  [3,3,1,1,0,0,1,1,0,0,1,1,1,1,1,1,0,0,1,1,0,0,1,1,3,3];
            _mapArr[21] =  [3,3,1,1,0,0,1,1,0,0,1,1,1,1,1,1,0,0,0,0,0,0,0,0,3,3];
            _mapArr[22] =  [0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3,3];
            _mapArr[23] =  [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3,3];
            _mapArr[24] =  [3,3,0,0,0,0,0,0,0,0,0,1,1,1,1,0,0,0,1,1,1,1,1,1,3,3];
            _mapArr[25] =  [3,3,1,1,0,0,1,1,0,0,0,1,0,0,1,0,0,0,1,1,1,1,1,1,0,0];
            _mapArr[26] =  [3,3,1,1,0,0,1,1,0,0,0,1,0,0,1,0,0,0,1,1,1,1,1,1,0,0];

            this.mapArr = _mapArr;
            //console.log( this.mapArr );

            var _content = '';
            for( var i=0; i < 26; i++ ){
                for( var j=0; j < 26; j++ ){

                    if( !this.mapArr[i][j] ){ // 无障碍物
                        _content += '<img src="img/blank.png">';

                    }else{

                        if( this.mapArr[i][j] == 1 ){ // 砖头（可击破）
                            _content += '<img src="img/brick.png">';

                        }else if( this.mapArr[i][j] == 2 ){ // 墙（不可击破）
                            _content += '<img src="img/wall.png">';

                        }else if( this.mapArr[i][j] == 3 ){ // 河水（子弹可通过）
                            _content += '<img src="img/river.png">';
                        }
                    }
                }
            }

            $('.container').append( _content );

        },

    }
})();

var init = index.init.bind( index );